In [ ]:
for details in range(6):
    name=input("Enter name:")
    age= input("Enter Age")
    marks= input("Enter marks")

Enter name: Konya
Enter Age 23
Enter marks 60

In [7]:
def function(numb,number2):
    results=number1+number2
    return results

In [9]:
function(7,8)

15

In [25]:

temperature =[9,10,11]
x=0
for x in temperature:
    Far=[ x+2]

In [27]:
Far

[13]

In [57]:
temprature=[10,50,60]
farenheit_tempratures=[(y*9/5)+32 for y in temprature]

farenheit_tempratures

In [47]:
temperature=[10,20,30]
farenheit_temprature=[(y*9/5)+32 for y in temperature]

In [49]:
farenheit_temprature

[50.0, 68.0, 86.0]

In [55]:
farenheit_tempratures

[50.0, 122.0, 140.0]

In [59]:
farenheit_tempratures

[50.0, 122.0, 140.0]

In [63]:
dictionary={
    "name":["student1","student2","student3","student4","student5","student6"],
     "Maths":[20,40,67,45,90,78]
}

In [65]:
dictionary

{'name': ['student1',
  'student2',
  'student3',
  'student4',
  'student5',
  'student6'],
 'Maths': [20, 40, 67, 45, 90, 78]}

In [67]:
import pandas as pd

In [71]:
Student_Details = pd.DataFrame(dictionary)

In [73]:
Student_Details

       name  Maths
0  student1     20
1  student2     40
2  student3     67
3  student4     45
4  student5     90
5  student6     78

In [75]:
Student_Details["English"]=[40,50,89,70,80,90]

In [77]:
Student_Details

       name  Maths  English
0  student1     20       40
1  student2     40       50
2  student3     67       89
3  student4     45       70
4  student5     90       80
5  student6     78       90

In [85]:
Student_Details["Average"]=Student_Details[["Maths","English"]].mean(axis=1)

In [87]:
Student_Details

       name  Maths  English  Average
0  student1     20       40     30.0
1  student2     40       50     45.0
2  student3     67       89     78.0
3  student4     45       70     57.5
4  student5     90       80     85.0
5  student6     78       90     84.0

In [93]:
Student_Details["Average"].max()

85.0

In [ ]:
Student_Details["Average"]`

In [1]:
import pandas as pd

In [5]:
filepath ="Data_Files/car_sales.csv"

In [7]:
df = pd.read_csv(filepath)

In [9]:
df

   Manufacturer      Model  Year  Sales  Revenue
0        Toyota    Corolla  2021   1500    50000
1        Toyota      Camry  2022   2000    70000
2         Honda      Civic  2022   1800    60000
3         Honda     Accord  2021   1700    65000
4          Ford    Mustang  2023   2200    80000
5          Ford     Fusion  2021   1600    55000
6     Chevrolet  Silverado  2022   1900    75000
7     Chevrolet     Malibu  2021   1400    50000
8        Nissan     Altima  2022   2100    70000
9        Nissan     Sentra  2023   2300    85000
10       Toyota      Prius  2021   1600    60000
11       Toyota       RAV4  2022   1900    65000
12        Honda       CR-V  2023   2200    75000
13        Honda      Pilot  2021   1500    55000
14         Ford   Explorer  2022   2000    70000
15         Ford     Escape  2023   2100    75000
16    Chevrolet    Equinox  2021   1700    60000
17    Chevrolet      Tahoe  2022   2200    80000
18       Nissan      Rogue  2023   2300    85000
19       Nissan     Murano  2021   1800    65000

In [15]:
df.tail(5)

   Manufacturer    Model  Year  Sales  Revenue
15         Ford   Escape  2023   2100    75000
16    Chevrolet  Equinox  2021   1700    60000
17    Chevrolet    Tahoe  2022   2200    80000
18       Nissan    Rogue  2023   2300    85000
19       Nissan   Murano  2021   1800    65000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  20 non-null     object
 1   Model         20 non-null     object
 2   Year          20 non-null     int64
 3   Sales         20 non-null     int64
 4   Revenue       20 non-null     int64
dtypes: int64(3), object(2)
memory usage: 932.0+ bytes

In [25]:
df.dtypes()

TypeError: 'Series' object is not callable

In [55]:
filtered=df[df["Year" ]==2022]

In [57]:
filtered

   Manufacturer      Model  Year  Sales  Revenue
1        Toyota      Camry  2022   2000    70000
2         Honda      Civic  2022   1800    60000
6     Chevrolet  Silverado  2022   1900    75000
8        Nissan     Altima  2022   2100    70000
11       Toyota       RAV4  2022   1900    65000
14         Ford   Explorer  2022   2000    70000
17    Chevrolet      Tahoe  2022   2200    80000

In [73]:
df["Profits"]=df["Revenue"]*0.1

In [75]:
df

   Manufacturer      Model  Year  Sales  Revenue  Profits
0        Toyota    Corolla  2021   1500    50000   5000.0
1        Toyota      Camry  2022   2000    70000   7000.0
2         Honda      Civic  2022   1800    60000   6000.0
3         Honda     Accord  2021   1700    65000   6500.0
4          Ford    Mustang  2023   2200    80000   8000.0
5          Ford     Fusion  2021   1600    55000   5500.0
6     Chevrolet  Silverado  2022   1900    75000   7500.0
7     Chevrolet     Malibu  2021   1400    50000   5000.0
8        Nissan     Altima  2022   2100    70000   7000.0
9        Nissan     Sentra  2023   2300    85000   8500.0
10       Toyota      Prius  2021   1600    60000   6000.0
11       Toyota       RAV4  2022   1900    65000   6500.0
12        Honda       CR-V  2023   2200    75000   7500.0
13        Honda      Pilot  2021   1500    55000   5500.0
14         Ford   Explorer  2022   2000    70000   7000.0
15         Ford     Escape  2023   2100    75000   7500.0
16    Chevrolet    Equinox  2021   1700    60000   6000.0
17    Chevrolet      Tahoe  2022   2200    80000   8000.0
18       Nissan      Rogue  2023   2300    85000   8500.0
19       Nissan     Murano  2021   1800    65000   6500.0

In [79]:
filtered1 =df[["Manufacturer","Revenue"]]

In [81]:
filtered1

   Manufacturer  Revenue
0        Toyota    50000
1        Toyota    70000
2         Honda    60000
3         Honda    65000
4          Ford    80000
5          Ford    55000
6     Chevrolet    75000
7     Chevrolet    50000
8        Nissan    70000
9        Nissan    85000
10       Toyota    60000
11       Toyota    65000
12        Honda    75000
13        Honda    55000
14         Ford    70000
15         Ford    75000
16    Chevrolet    60000
17    Chevrolet    80000
18       Nissan    85000
19       Nissan    65000

In [83]:
grouped = df.groupby("Manufacturer")
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E11EAFFF50>

In [85]:
grouped

In [105]:
x =df.loc[df['Manufacturer']== "Toyota"]

In [103]:
df["Revenue"].sum()

1350000

In [107]:
x

   Manufacturer    Model  Year  Sales  Revenue  Profits
0        Toyota  Corolla  2021   1500    50000   5000.0
1        Toyota    Camry  2022   2000    70000   7000.0
10       Toyota    Prius  2021   1600    60000   6000.0
11       Toyota     RAV4  2022   1900    65000   6500.0

In [109]:
y =df.loc[df['Manufacturer']== "Nissan"]

In [111]:
y

   Manufacturer   Model  Year  Sales  Revenue  Profits
8        Nissan  Altima  2022   2100    70000   7000.0
9        Nissan  Sentra  2023   2300    85000   8500.0
18       Nissan   Rogue  2023   2300    85000   8500.0
19       Nissan  Murano  2021   1800    65000   6500.0

In [117]:
Nissan_Revenue= y["Revenue"].sum()

In [119]:
Nissan_Revenue

305000

In [121]:
df

   Manufacturer      Model  Year  Sales  Revenue  Profits
0        Toyota    Corolla  2021   1500    50000   5000.0
1        Toyota      Camry  2022   2000    70000   7000.0
2         Honda      Civic  2022   1800    60000   6000.0
3         Honda     Accord  2021   1700    65000   6500.0
4          Ford    Mustang  2023   2200    80000   8000.0
5          Ford     Fusion  2021   1600    55000   5500.0
6     Chevrolet  Silverado  2022   1900    75000   7500.0
7     Chevrolet     Malibu  2021   1400    50000   5000.0
8        Nissan     Altima  2022   2100    70000   7000.0
9        Nissan     Sentra  2023   2300    85000   8500.0
10       Toyota      Prius  2021   1600    60000   6000.0
11       Toyota       RAV4  2022   1900    65000   6500.0
12        Honda       CR-V  2023   2200    75000   7500.0
13        Honda      Pilot  2021   1500    55000   5500.0
14         Ford   Explorer  2022   2000    70000   7000.0
15         Ford     Escape  2023   2100    75000   7500.0
16    Chevrolet    Equinox  2021   1700    60000   6000.0
17    Chevrolet      Tahoe  2022   2200    80000   8000.0
18       Nissan      Rogue  2023   2300    85000   8500.0
19       Nissan     Murano  2021   1800    65000   6500.0

In [137]:
sum_salary = df.groupby("Manufacturer")["Revenue"].sum()

In [139]:
sum_salary

Manufacturer
Chevrolet    265000
Ford         280000
Honda        255000
Nissan       305000
Toyota       245000
Name: Revenue, dtype: int64